In [5]:
import os
import pandas as pd

os.chdir("/home/mediaworker/anaconda2/envs/pandas_playground/")

df = pd.read_csv("datasets/employees.csv")

df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance

In [6]:
# summary and parameters
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null object
Start Date           1000 non-null object
Last Login Time      1000 non-null object
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    933 non-null object
Team                 957 non-null object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [8]:
df["Start Date"].head(3)

0     8/6/1993
1    3/31/1996
2    4/23/1993
Name: Start Date, dtype: object

In [11]:
# convert string to datetime object
df["Start Date"] = pd.to_datetime(df["Start Date"])

In [12]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance

In [14]:
df["Last Login Time"] = pd.to_datetime(df["Last Login Time"])

In [15]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-08-01 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-08-01 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-08-01 11:17:00,130590,11.858,False,Finance

In [17]:
df["Senior Management"] = df["Senior Management"].astype("bool")

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null object
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null datetime64[ns]
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    1000 non-null bool
Team                 957 non-null object
dtypes: bool(1), datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 55.7+ KB

In [19]:
df["Gender"] = df["Gender"].astype("category")

In [20]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-08-01 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-08-01 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-08-01 11:17:00,130590,11.858,False,Finance

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null category
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null datetime64[ns]
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    1000 non-null bool
Team                 957 non-null object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.0+ KB

In [22]:
# syntax 2
# while reading from csv itself one can specify to parse_dates
df = pd.read_csv("datasets/employees.csv", parse_dates=["Start Date", "Last Login Time"])

# following two steps reduced
 ##df["Start Date"] = pd.to_datetime(df["Start Date"])
 ##df["Last Login Time"] = pd.to_datetime(df["Last Login Time"])

df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")

df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-08-01 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-08-01 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-08-01 11:17:00,130590,11.858,False,Finance